app/controllers/endpoints_controller.rb

SELECT "endpoints".* FROM "endpoints" ORDER BY "endpoints"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
  def index
    @endpoints = Endpoint.all

INSERT INTO "endpoints" ("verb", "path", "response", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    @endpoint = Endpoint.new(endpoint_params)

    if @endpoint.save

SELECT "endpoints".* FROM "endpoints" WHERE "endpoints"."path" = ? AND "endpoints"."verb" = ? LIMIT ?  [["path", "/endpoints"], ["verb", "PATCH"], ["LIMIT", 1]]
SELECT "endpoints".* FROM "endpoints" WHERE "endpoints"."path" = ? AND "endpoints"."verb" = ? LIMIT ?  [["path", "/hello"], ["verb", "GET"], ["LIMIT", 1]]
---
  def echo
    endpoint = Endpoint.find_by(path: request.path, verb: request.method)

    if endpoint.present?
      endpoint.headers.each do |key, value|

DELETE FROM "endpoints" WHERE "endpoints"."id" = ?  [["id", 2]]
---
  def destroy
    @endpoint.destroy

SELECT "endpoints".* FROM "endpoints" WHERE "endpoints"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
  def set_endpoint
    @endpoint = Endpoint.find(params[:id])